# Handle Missing Values

In [1]:
import pandas as pd

In [10]:
df = pd.read_csv('Dataset salary 2024 messing.csv')

In [11]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024.0,SE,FT,AI Engineer,202730.0,USD,202730.0,US,0.0,US,M
1,2024.0,SE,FT,AI Engineer,92118.0,USD,92118.0,US,0.0,US,M
2,2024.0,SE,FT,Data Engineer,130500.0,USD,130500.0,US,0.0,US,M
3,NaN,SE,FT,Data Engineer,96000.0,USD,96000.0,US,0.0,US,M
4,2024.0,SE,FT,NaN,190000.0,USD,190000.0,US,0.0,US,M

In [6]:
# Check for missing values
missing_values = df.isnull().sum()
print("\nMissing values in each column:\n", missing_values)

Missing values in each column:
 work_year             5
experience_level      1
employment_type       5
job_title             2
salary                4
salary_currency       1
salary_in_usd         3
employee_residence    0
remote_ratio          9
company_location      4
company_size          3
dtype: int64

# using mean for numerical columns

In [8]:
# Mean imputation for numerical columns
for column in df.columns:
    if df[column].dtype in ['int64', 'float64']:
        df[column].fillna(df[column].mean(), inplace=True)

In [12]:
# Check for missing values
df.isnull().sum()

work_year             5
experience_level      1
employment_type       5
job_title             2
salary                4
salary_currency       1
salary_in_usd         3
employee_residence    0
remote_ratio          9
company_location      4
company_size          3
dtype: int64

# using median for numerical column

In [13]:
# median imputation for numerical columns
for column in df.columns:
    if df[column].dtype in ['int64', 'float64']:
        df[column].fillna(df[column].median(), inplace=True)

In [14]:
# Check for missing values
df.isnull().sum()

work_year             0
experience_level      1
employment_type       5
job_title             2
salary                0
salary_currency       1
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      4
company_size          3
dtype: int64

# using mode for categorical columns

In [15]:
for column in df.columns:
    if df[column].dtype in ['object']:
        mode_value = df[column].mode()[0]
        print(f"\nMode for '{column}': {mode_value}")

Mode for 'experience_level': SE

Mode for 'employment_type': FT

Mode for 'job_title': Data Engineer

Mode for 'salary_currency': USD

Mode for 'employee_residence': US

Mode for 'company_location': US

Mode for 'company_size': M

In [16]:
# mode imputation for numerical columns
for column in df.columns:
    if df[column].dtype in ['object']:
        df[column].fillna(df[column].mode()[0], inplace=True)

In [17]:
# Check for missing values
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64